In [3]:
import pandas as pd

data = pd.read_csv('data/aluguel.csv', sep = ';')
data.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,53.33,Apartamento
1,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,16.67,Apartamento
2,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,26.00,Apartamento
3,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0,21.43,Apartamento
4,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0,16.67,Apartamento

In [4]:
# Count how mutch propertys there are:

# 1 and 2
# 3 and 4
# 5 and 6
# 7 or more

classes = [0, 2, 4, 6, 100]

In [16]:
rooms = pd.cut(data['Quartos'], classes)
rooms

0        (0.0, 2.0]
1        (0.0, 2.0]
2        (0.0, 2.0]
3        (0.0, 2.0]
4               NaN
            ...
19826    (0.0, 2.0]
19827    (0.0, 2.0]
19828    (0.0, 2.0]
19829    (0.0, 2.0]
19830           NaN
Name: Quartos, Length: 19831, dtype: category
Categories (1, interval[int64, right]): [(0, 2]]

In [7]:
pd.value_counts(rooms)

(0, 2]      11074
(2, 4]       8094
(4, 6]        470
(6, 100]       36
Name: Quartos, dtype: int64

In [11]:
labels = ['1 and 2 rooms', '3 and 4 rooms', '5 and 6 rooms', '7 or more rooms']
rooms = pd.cut(data['Quartos'], classes, labels = labels)
pd.value_counts(rooms)

1 and 2 rooms      11074
3 and 4 rooms       8094
5 and 6 rooms        470
7 or more rooms       36
Name: Quartos, dtype: int64

In [13]:
labels = ['0 and 2 rooms', '3 and 4 rooms', '5 and 6 rooms', '7 or more rooms']
rooms = pd.cut(data['Quartos'], classes, labels = labels, include_lowest = True)
pd.value_counts(rooms)

0 and 2 rooms      11231
3 and 4 rooms       8094
5 and 6 rooms        470
7 or more rooms       36
Name: Quartos, dtype: int64